StanleyC1/XCJXT-arduino-esp32/boards.txt
# Official Espressif options
menu.UploadSpeed=Upload Speed
menu.USBMode=USB Mode
menu.CDCOnBoot=USB CDC On Boot
menu.MSCOnBoot=USB Firmware MSC On Boot
menu.DFUOnBoot=USB DFU On Boot
menu.UploadMode=Upload Mode
menu.CPUFreq=CPU Frequency
menu.FlashFreq=Flash Frequency
menu.FlashMode=Flash Mode
menu.FlashSize=Flash Size
menu.PartitionScheme=Partition Scheme
menu.DebugLevel=Core Debug Level
menu.PSRAM=PSRAM
menu.LoopCore=Arduino Runs On
menu.EventsCore=Events Run On
menu.MemoryType=Memory Type
menu.EraseFlash=Erase All Flash Before Sketch Upload
menu.JTAGAdapter=JTAG Adapter
menu.ZigbeeMode=Zigbee Mode
menu.PinNumbers=Pin Numbering
menu.ChipVariant=Chip Variant


##############################################################
# XCJXT
# ESP32-S3-WROOM-1-N16R8 | 16MB Flash | 8MB OPI PSRAM
##############################################################

xcjxt.name=XCJXT

xcjxt.bootloader.tool=esptool_py
xcjxt.bootloader.tool.default=esptool_py

xcjxt.upload.tool=esptool_py
xcjxt.upload.tool.default=esptool_py
xcjxt.upload.tool.network=esp_ota

xcjxt.upload.maximum_size=8323072
xcjxt.upload.maximum_data_size=327680
xcjxt.upload.flags=
xcjxt.upload.extra_flags=
xcjxt.upload.use_1200bps_touch=false
xcjxt.upload.wait_for_upload_port=false

xcjxt.serial.disableDTR=false
xcjxt.serial.disableRTS=false

xcjxt.build.tarch=xtensa
xcjxt.build.bootloader_addr=0x0
xcjxt.build.target=esp32s3
xcjxt.build.mcu=esp32s3
xcjxt.build.core=esp32
xcjxt.build.variant=CJXT
xcjxt.build.board=CJXT

xcjxt.build.usb_mode=1
xcjxt.build.cdc_on_boot=0
xcjxt.build.msc_on_boot=0
xcjxt.build.dfu_on_boot=0
xcjxt.build.f_cpu=240000000L
xcjxt.build.flash_size=16MB
xcjxt.build.flash_freq=80m
xcjxt.build.flash_mode=dio
xcjxt.build.boot=qio
xcjxt.build.boot_freq=80m
xcjxt.build.partitions=cjxt_8Mapp_8Mspiffs
xcjxt.build.defines=-DBOARD_HAS_PSRAM
xcjxt.build.loop_core=
xcjxt.build.event_core=
xcjxt.build.psram_type=opi
xcjxt.build.memory_type={build.boot}_{build.psram_type}

xcjxt.menu.JTAGAdapter.default=Disabled
xcjxt.menu.JTAGAdapter.default.build.copy_jtag_files=0
xcjxt.menu.JTAGAdapter.builtin=Integrated USB JTAG
xcjxt.menu.JTAGAdapter.builtin.build.openocdscript=esp32s3-builtin.cfg
xcjxt.menu.JTAGAdapter.builtin.build.copy_jtag_files=1
xcjxt.menu.JTAGAdapter.external=FTDI Adapter
xcjxt.menu.JTAGAdapter.external.build.openocdscript=esp32s3-ftdi.cfg
xcjxt.menu.JTAGAdapter.external.build.copy_jtag_files=1
xcjxt.menu.JTAGAdapter.bridge=ESP USB Bridge
xcjxt.menu.JTAGAdapter.bridge.build.openocdscript=esp32s3-bridge.cfg
xcjxt.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

xcjxt.menu.FlashMode.qio=QIO 80MHz
xcjxt.menu.FlashMode.qio.build.flash_mode=dio
xcjxt.menu.FlashMode.qio.build.boot=qio
xcjxt.menu.FlashMode.qio.build.boot_freq=80m
xcjxt.menu.FlashMode.qio.build.flash_freq=80m
xcjxt.menu.FlashMode.qio120=QIO 120MHz
xcjxt.menu.FlashMode.qio120.build.flash_mode=dio
xcjxt.menu.FlashMode.qio120.build.boot=qio
xcjxt.menu.FlashMode.qio120.build.boot_freq=120m
xcjxt.menu.FlashMode.qio120.build.flash_freq=80m
xcjxt.menu.FlashMode.dio=DIO 80MHz
xcjxt.menu.FlashMode.dio.build.flash_mode=dio
xcjxt.menu.FlashMode.dio.build.boot=dio
xcjxt.menu.FlashMode.dio.build.boot_freq=80m
xcjxt.menu.FlashMode.dio.build.flash_freq=80m
xcjxt.menu.FlashMode.opi=OPI 80MHz
xcjxt.menu.FlashMode.opi.build.flash_mode=dout
xcjxt.menu.FlashMode.opi.build.boot=opi
xcjxt.menu.FlashMode.opi.build.boot_freq=80m
xcjxt.menu.FlashMode.opi.build.flash_freq=80m

xcjxt.menu.LoopCore.1=Core 1
xcjxt.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
xcjxt.menu.LoopCore.0=Core 0
xcjxt.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

xcjxt.menu.EventsCore.1=Core 1
xcjxt.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
xcjxt.menu.EventsCore.0=Core 0
xcjxt.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

xcjxt.menu.USBMode.default=Hardware CDC and JTAG
xcjxt.menu.USBMode.default.build.usb_mode=1
xcjxt.menu.USBMode.hwcdc=USB-OTG (TinyUSB)
xcjxt.menu.USBMode.hwcdc.build.usb_mode=0

xcjxt.menu.CDCOnBoot.default=Disabled
xcjxt.menu.CDCOnBoot.default.build.cdc_on_boot=0
xcjxt.menu.CDCOnBoot.cdc=Enabled
xcjxt.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

xcjxt.menu.MSCOnBoot.default=Disabled
xcjxt.menu.MSCOnBoot.default.build.msc_on_boot=0
xcjxt.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
xcjxt.menu.MSCOnBoot.msc.build.msc_on_boot=1

xcjxt.menu.DFUOnBoot.default=Disabled
xcjxt.menu.DFUOnBoot.default.build.dfu_on_boot=0
xcjxt.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
xcjxt.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

xcjxt.menu.UploadMode.default=UART0 / Hardware CDC
xcjxt.menu.UploadMode.default.upload.use_1200bps_touch=false
xcjxt.menu.UploadMode.default.upload.wait_for_upload_port=false
xcjxt.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
xcjxt.menu.UploadMode.cdc.upload.use_1200bps_touch=true
xcjxt.menu.UploadMode.cdc.upload.wait_for_upload_port=true

xcjxt.menu.PartitionScheme.8Mapp8Mspiffs=8MB APP / 8MB SPIFFS (Default)
xcjxt.menu.PartitionScheme.8Mapp8Mspiffs.build.partitions=cjxt_8Mapp_8Mspiffs
xcjxt.menu.PartitionScheme.8Mapp8Mspiffs.upload.maximum_size=8323072

xcjxt.menu.PartitionScheme.default16M=Default 16MB (1.2MB APP / 13MB SPIFFS)
xcjxt.menu.PartitionScheme.default16M.build.partitions=default_16MB
xcjxt.menu.PartitionScheme.default16M.upload.maximum_size=1310720

xcjxt.menu.PartitionScheme.maxapp=Huge APP (16MB APP No FS)
xcjxt.menu.PartitionScheme.maxapp.build.partitions=max_app_16MB
xcjxt.menu.PartitionScheme.maxapp.upload.maximum_size=16646144

xcjxt.menu.CPUFreq.240=240MHz (WiFi)
xcjxt.menu.CPUFreq.240.build.f_cpu=240000000L
xcjxt.menu.CPUFreq.160=160MHz (WiFi)
xcjxt.menu.CPUFreq.160.build.f_cpu=160000000L
xcjxt.menu.CPUFreq.80=80MHz (WiFi)
xcjxt.menu.CPUFreq.80.build.f_cpu=80000000L
xcjxt.menu.CPUFreq.40=40MHz
xcjxt.menu.CPUFreq.40.build.f_cpu=40000000L
xcjxt.menu.CPUFreq.20=20MHz
xcjxt.menu.CPUFreq.20.build.f_cpu=20000000L
xcjxt.menu.CPUFreq.10=10MHz
xcjxt.menu.CPUFreq.10.build.f_cpu=10000000L

xcjxt.menu.UploadSpeed.921600=921600
xcjxt.menu.UploadSpeed.921600.upload.speed=921600
xcjxt.menu.UploadSpeed.115200=115200
xcjxt.menu.UploadSpeed.115200.upload.speed=115200
xcjxt.menu.UploadSpeed.256000.windows=256000
xcjxt.menu.UploadSpeed.256000.upload.speed=256000
xcjxt.menu.UploadSpeed.230400.windows.upload.speed=256000
xcjxt.menu.UploadSpeed.230400=230400
xcjxt.menu.UploadSpeed.230400.upload.speed=230400
xcjxt.menu.UploadSpeed.460800.linux=460800
xcjxt.menu.UploadSpeed.460800.macosx=460800
xcjxt.menu.UploadSpeed.460800.upload.speed=460800
xcjxt.menu.UploadSpeed.512000.windows=512000
xcjxt.menu.UploadSpeed.512000.upload.speed=512000

xcjxt.menu.DebugLevel.none=None
xcjxt.menu.DebugLevel.none.build.code_debug=0
xcjxt.menu.DebugLevel.error=Error
xcjxt.menu.DebugLevel.error.build.code_debug=1
xcjxt.menu.DebugLevel.warn=Warn
xcjxt.menu.DebugLevel.warn.build.code_debug=2
xcjxt.menu.DebugLevel.info=Info
xcjxt.menu.DebugLevel.info.build.code_debug=3
xcjxt.menu.DebugLevel.debug=Debug
xcjxt.menu.DebugLevel.debug.build.code_debug=4
xcjxt.menu.DebugLevel.verbose=Verbose
xcjxt.menu.DebugLevel.verbose.build.code_debug=5

xcjxt.menu.EraseFlash.none=Disabled
xcjxt.menu.EraseFlash.none.upload.erase_cmd=
xcjxt.menu.EraseFlash.all=Enabled
xcjxt.menu.EraseFlash.all.upload.erase_cmd=-e

